#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+CATEGORY:
#+TAGS:       Write(w) Update(u) Fix(f) Check(c)
#+LANGUAGE:   en
#+PRIORITIES: A C B
#+OPTIONS:    H:3 num:t toc:t \n:nil ::t |:t ^:nil -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gtcp2305.github.io/css/worg.min.css"/>
#+TITLE: Names And Memory Layout
本系列是我学习C++的一个记录，主要参考《Primer C++(5th)》和《深入理解计算机系统
（3th）》，目标是不仅要知道C++的语法规则，并且尽量探究在這些规则背后的原理。做到
知道其所以然才能知其然。
*** 访问数组元素
数组元素可以用范围 ~for~ 语句或下标运算符访问，数组下标通常被定义为 ~size_t~ 类
型，是一种与机器无关的无符号类型，但是在使用下标的时候必须要保证下标在合理的范围
之内，防止下标越界。
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  #include <iostream>
  int main(int argc, char *argv[])
  {
      double scores[] = {90.0,83.3,75.1};
      for(const auto i : scores)
      {
          std::cout<<i<<" ";
      }
      std::cout<<"\n";
      return 0;
  }

#+END_SRC

#+RESULTS:
: 90 83.3 75.1
*** 数组与指针
在使用数组时，编译器一般会把它转变为指针：在很多用到数组名字的地方，编译器会自动
将其转换为指向首元素的指针。但是有一种情况例外 ~decltype~:
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  #include <iostream>
  int main(int argc, char *argv[])
  {
      int ia[]{1,2,3,4,5};
      auto ia2(ia);        //ia2是指针类型
      ,*ia2 = 6;
      std::cout<<ia[0]<<"\n";
      decltype(ia) ia3 = {6,7,8,9,0};
      for(const auto& e : ia3)
          std::cout<<e<<" ";
      std::cout<<"\n";
      return 0;
  }
#+END_SRC
#+RESULTS:
: 6
: 6 7 8 9 0
除了使用数组可以获得首元素的指针以外，还可以使用标准库函数(begin end)获得首元素和尾后元素的
指针，它们定义在 ~iterator~ 头文件中，
**** 指针运算
指针可以进行解引用，递增递减，与整数相加减，两个指针比较大小，两个指针相减等操作。
与整数相加减是地址前进了该整数个距离(大小由类型决定),结果仍是指针；两个指针相减
的结果是它们之间的距离，参与运算的两个指针必须指向同一个数组中的元素，结果类型是
~ptediff_t~,是一种带符号类型， 这样的两个指针还能比较大小，通常数组后面的指针比
前面的大。
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  #include <iostream>
  #include <iterator>
  int main(int argc, char *argv[])
  {
      int arr[]{1,2,3,4,5};
      auto diff = std::end(arr) - std::begin(arr);
      std::cout<<"diff is "<<diff<<"\n";
      auto b = std::begin(arr)+1;
      auto e = std::end(arr);
      while(b < e)
      {
          std::cout<< *b++<<" ";
      }

      return 0;
  }

#+END_SRC

#+RESULTS:
: diff is 5
: 2 3 4 5
**** 使用数组初始化 vector
虽然不允许内置数组之间拷贝和赋值，也不允许用 ~vector~ 为数组初始化，但是可以使用
内置数组为 =vector= 对象赋初值。
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  #include <vector>
  #include <iterator>
  #include <iostream>
  int main(int argc, char *argv[])
  {
      int arr[] = {1,2,3,4,5,6,7,8,9,0};
      std::vector<int> veci(std::begin(arr),std::end(arr));
      for(const auto & e : veci)
          std::cout<<e<<" ";
      std::cout<<"\n";
      return 0;
  }
#+END_SRC

#+RESULTS:
: 1 2 3 4 5 6 7 8 9 0
**** 多维数组的下标运算
可以使用下标运算符来访问多维数组的元素，此时数组的每个维度对应一个下标运算符。如
果表达式含有的下标运算符数量与数组的维度一样多，该表达式的结果将是给定类型的元素；
反之，如果表达式含有的下标运算符数量比数组维度小，则表达式的结果将是给定索引处的
一个内层数组。
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  int arr[10][20][30] = {0}; //将所有元素初始化为0
  int ia[3][4] = {
      {0,1,2,3},
      {4,5,6,7},
      {8,9,10,11},
  };

  ia[2][3] = arr[0][0][0];
  int (&row)[4] = ia[1];    //将row 绑定到第二个4元素数组上
#+END_SRC

#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  #include <iostream>
  int main(int argc, char *argv[])
  {
      constexpr int rowCnt = 3;
      constexpr int colCnt = 4;
      int ia[rowCnt][colCnt];
      for(size_t i = 0; i < rowCnt; ++i)
      {
          for(size_t j = 0; j < colCnt; ++j)
          {
              ia[i][j] = i * colCnt + j;
          }
      }
      for (auto &row : ia) {        //之所以使用引用是为了避免数组退化为指针
          for (auto &col : row) {
              std::cout<<col<<" ";
          }

      }

      return 0;
  }
#+END_SRC

#+RESULTS:
: 0 1 2 3 4 5 6 7 8 9 10 11
*Note*: 要使用范围 =for= 语句处理多维数组，除了最内层的循环外，其它所有循环的控
制变量都应该使用引用类型。
**** 指针和多维数组
当程序使用多维数组的名字时，也会自动将其转换为指向数组首元素(第一个内层数组)的指
针，
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
    #include <iostream>
    #include <iterator>
    int main(int argc, char *argv[])
    {
        int ia[3][4] =
            {
                {0,1,2,3},
                {4,5,6,7},
                {8,9,10,11},
            };

        int (*p)[4] = ia;  //指向ia[0]
        for(auto e = std::begin(*p);e != std::end(*p); ++e)   //*p 的类型为int[4],时数组；e 是该数组的迭代器
            std::cout<<*e<<" ";
        std::cout<<"\n";

        p = &ia[2];        //指向ia[2]
        for(auto e : *p)   //e 是int 类型，为数组中的元素
            std::cout<<e<<" ";
        std::cout<<"\n";
        return 0;
    }
#+END_SRC

#+RESULTS:
: 0 1 2 3
: 8 9 10 11
使用类型别名可以简化指向多维数组的指针，让人更容易理解这类指针。
#+BEGIN_SRC C++ -n -r :exports both :results value verbatim
  #include <iostream>
  #include <iterator>
  typedef int intArrFoure[4];
  // using intArrFoure = int[4]; //c++11中的等价表达式

  int main(int argc, char *argv[])
  {
      int ia[3][4] =
          {
              {0,1,2,3},
              {4,5,6,7},
              {8,9,10,11},
          };
      for(intArrFoure *p = ia; p != ia+3; ++p)
          for(auto e : *p)
              std::cout<<e<<" ";
      std::cout<<"\n";
      return 0;
  }

#+END_SRC

#+RESULTS:
: 0 1 2 3 4 5 6 7 8 9 10 11
